{
    "Home": "Home",
    "Complexity": "Complexity",
    "Dashboard": "Dashboard",
    "Meta-Feature": "Meta-Features",
    "Select-dataset": "Select dataset ...",
    "Drag-drop": "Drag and drop or select files",
    "Msg-load-file" : "The data to perform the functionalities has not been added, load a file to continue",
    "Welcome": "Welcome!",
    "welcome-card": "This application is designed to make data analysis and visualization both efficient and accurate. With our tools, you can easily create customized charts, calculate metafeatures, and evaluate the complexity of your data in a simple and intuitive way. Our goal is to provide you with the necessary tools to deepen your analysis, enabling you to select the most appropriate evaluation techniques and algorithms for your needs.",
    "Download-CSV": "Download CSV",
    "Unsoported-file": "Unsupported file format. Please upload a CSV, EXCEL or ARFF file.",
    "No-data": "No data loaded",
    "Go-back": "Go back to home",
    "Select-Input-Feature": "Select Input Feature:",
    "Select-Class-Feature": "Select Class Feature:",
    "Select-Graph-Type": "Select Graph Type:",
    "Generate-Plot": "Generate Plot",
    "Plot-Alert": "Please select both input features and a class feature.",
    "Alert": "Please select input features, class feature and a classifier.",
    "Scatter-Plot": "Scatter Plot",
    "Pie-Chart": "Pie Chart",
    "Histogram": "Histogram",
    "Line-Chart": "Line Chart",
    "Box-Plot": "Box Plot",
    "Heatmap": "Heatmap",
    "Suggest" : "Suggest the best classifier",
    "Train": "Train",
    "Select-classifier": "Select classifier",
    "Suggested-model": "The model suggest ",
    "Select-hyperparameters": "Select hyperparameters",
    "Calculate-Measures": "Calculate Measures",
    "Calculate-Meta-Features": "Calculate Meta-Features",
    "f1": "Maximum Fisher’s Discriminant Ratio: Measures how well the classes are separated relative to their internal variability.",
    "f1-d": " Higher values indicate that the classes are well-separated, making classification easier.",
    "f1v": "Directional-vector Maximum Fisher’s Discriminant Ratio: A variant of Fisher's Discriminant Ratio that considers the directions of the vectors.",
    "f1v-d": "Lower values may indicate greater difficulty in class separation.",
    "f2": "Overlap of the Per-class Bounding Boxes: Measures the overlap between the bounding boxes of different classes.",
    "f2-d": "Higher values indicate more overlap, suggesting that classes are less well-separated and thus harder to classify correctly.",
    "f3": "Maximum Individual Feature Efficiency: Evaluates the efficiency of the best individual feature for separating classes.",
    "f3-d": "Values close to 1 indicate that at least one feature separates the classes very well.",
    "f4": "Collective Feature Efficiency: Similar to f3, but measures the combined efficiency of all features in separating classes.",
    "f4-d": "A value close to 1 indicates that the feature set is highly effective for class separation.",
    "l1": "Sum of the Error Distance by Linear Programming",
    "l1-d": "Measures the difficulty of separating classes using a linear classifier via linear programming. Higher values indicate that finding a linear separation is more challenging.",
    "l2": "Error Rate of the Linear Classifier",
    "l2-d": "The classification error rate of a simple linear classifier. Higher values indicate that the problem is more difficult from the perspective of a linear classifier.",
    "l3": "Non-linearity of the Linear Classifier",
    "l3-d": "Measures the non-linearity of the problem concerning a linear classifier. Higher values indicate greater non-linearity and, therefore, more difficulty for linear classifiers.",
    "n1": "Fraction of Borderline Points: The proportion of instances that are near the decision boundary.",
    "n1-d": "The proportion of instances that are near the decision boundary. A high value suggests that many instances are close to the boundary between classes, which can complicate classification.",
    "n2": "Ratio of Intra/Extra Class Nearest Neighbor Distance: The ratio of intra-class to extra-class nearest neighbor distances. ",
    "n2-d": "A high value indicates that instances within the same class are closer to each other than to those of different classes, suggesting good class separation.",
    "n3": "Error Rate of the Nearest Neighbor Classifier. The error rate of a k-nearest neighbors (k-NN) classifier. ",
    "n3-d": "A high value indicates that a k-NN classifier has difficulty distinguishing between classes.",
    "n4": "Non-linearity of the Nearest Neighbor Classifier: Measures the non-linearity of the problem with respect to a k-NN classifier.",
    "n4-d": "High values suggest that the problem does not fit well with proximity-based classification.",
    "t1": "Fraction of Hyperspheres Covering Data. The proportion of the data covered by the minimum hyperspheres necessary to cover all data instances.",
    "t1-d": "A high value may indicate that the data is well-concentrated.",
    "lsc": "Local Set Cardinality. Measures the average number of neighbors of the same class in the local environment of each instance.",
    "lsc-d": "High values indicate a high local density of the same class, making classification easier.",
    "density": "Class Density: Measures the density of the class in the feature space.",
    "density-d": "High values suggest that the instances within each class are densely packed.",
    "clsCoef": "Clustering Coefficient, The clustering coefficient measures the probability that two neighbors of an instance are also neighbors of each other. ",
    "clsCoef-d": "High values indicate a strong clustering structure, which can simplify classification.",
    "hubs": "Hubness: Measures the prevalence of hubs, which are data points that frequently appear as neighbors to other points. ",
    "hubs-d": "A high value can indicate that some points are central in the feature space, potentially affecting the problem's difficulty.",
    "avg_samples_per_dimension": "Average samples per dimension.",
    "avg_samples_per_dimension-d": "Higher values are preferred; few data points per dimension can lead to overfitting.",
    "class_entropy": "Entropy of the class distribution.",
    "class_entropy-d": "Values closer to 1 indicate balanced classes. Lower values = more imbalance.",
    "imbalance_ratio": "Ratio between the majority and minority classes.",
    "imbalance_ratio-d": "Values closer to 1 are better. High values indicate strong imbalance.",
    "C1": "Maximum absolute correlation between each feature and the output, using Spearman's correlation.",
    "C1-d": "A high value indicates that at least one feature is strongly related to the output, suggesting that the problem is simpler to model.",
    "C2": "Average correlation between features and class.",
    "C2-d": "High values suggest that many features are related to the class, indicating a simpler problem.",
    "avg_pca_components": "Components required to capture 95% of variance.",
    "avg_pca_components-d": "Low values indicate that the data can be well represented with few dimensions.",
    "L3": "Evaluates how much the real data deviates from an ideal linear relationship.",
    "L3-d": "L3 ≈ 0: data follows an approximately linear relationship (low non-linearity). Large L3: the linear model struggles to generalize between similar points, suggesting a nonlinear structure in the data.",
    "S1": "Measures the dataset complexity by evaluating how different the labels (y) are for nearby instances connected in a minimum spanning tree (MST).",
    "S1-d": "Low value: nearby instances in input space have similar labels → smoother or more regular problem. High value: nearby instances have very different labels → greater complexity or noise in the data.",
    "Metric": "Metric",
    "Feature": "Característica",
    "Meta-Features-of-the-group": "Meta-Features of the group",
    "Value": "Value",
    "Measures": "Measures",
    "Feature-based-measures": "Feature based measures",
    "Class-imbalance-measures": "Class imbalance measures",
    "Correlation-Measures" : "Correlation measures",
    "Geometric-Measures": "Geometric measures",
    "Dimensionality-measures": "Dimensionality measures",
    "Network-measures": "Network measures",
    "Neighborhood-measures": "Neighborhood measures",
    "Smoothness-Measures": "Smoothness measures",
    "Description": "Description",
    "Interpretation": "Interpretation"
}
