{
    "Home": "Inicio",
    "Complexity": "Complejidad",
    "Dashboard": "Gráficos",
    "Meta-Feature": "Meta-Características",
    "Select-dataset": "Seleccionar conjunto de datos ...",
    "Drag-drop": "Arrastra y suelta o selecciona archivos",
    "Msg-load-file": "No se han agregado los datos para realizar las funcionalidades, carga un archivo para continuar",
    "Welcome": "¡Bienvenido!",
    "welcome-card": "Esta aplicación está diseñada para hacer que el análisis y la visualización de datos sean tanto eficientes como precisos. Con nuestras herramientas, puedes crear fácilmente gráficos personalizados, calcular metacaracterísticas y evaluar la complejidad de tus datos de manera simple e intuitiva. Nuestro objetivo es proporcionarte las herramientas necesarias para profundizar en tu análisis, permitiéndote seleccionar las técnicas de evaluación y algoritmos más apropiados para tus necesidades.",
    "Download-CSV": "Descargar CSV",
    "Unsoported-file": "Formato de archivo no compatible. Cargue un archivo CSV, EXCEL o ARFF.",
    "No-data": "No hay datos cargados",
    "Go-back": "Volver al inicio",
    "Select-Input-Feature": "Seleccionar Característica de Entrada:",
    "Select-Class-Feature": "Seleccionar Característica de Clase:",
    "Select-Graph-Type": "Seleccionar Tipo de Gráfico:",
    "Generate-Plot": "Generar Gráfico",
    "Plot-Alert": "Por favor, seleccione ambas características de entrada y una característica de clase",
    "Scatter-Plot": "Gráfico de Dispersión",
    "Pie-Chart": "Gráfico de Pastel",
    "Histogram": "Histograma",
    "Line-Chart": "Gráfico de Líneas",
    "Box-Plot": "Diagrama de Caja",
    "Heatmap": "Mapa de Calor",
    "Select-classifier": "Seleccionar clasificador",
    "Suggest" : "Sugerir el mejor clasificador",
    "Suggested-model": "El modelo sugiere usar  ",
    "Select-hyperparameters": "Selecciona hiperparametros",
    "Train": "Entrenar",
    "Calculate-Measures": "Calcular medidas",
    "Calculate-Meta-Features": "Calcular Meta-Características",
    "Meta-Features-of-the-group": "Meta-Características del grupo",
    "f1": "Máximo Cociente de Discriminación de Fisher: Mide qué tan bien están separadas las clases en relación con su variabilidad interna.",
    "f1-d": "Valores más altos indican que las clases están bien separadas, lo que facilita la clasificación.",
    "f1v": "Cociente de Discriminación de Fisher Direccional-Vectorial: Una variante del Cociente de Discriminación de Fisher que considera las direcciones de los vectores.",
    "f1v-d": "Valores más bajos pueden indicar mayor dificultad en la separación de las clases.",
    "f2": "Superposición de las Cajas Envolventes por Clase: Mide la superposición entre las cajas envolventes de diferentes clases.",
    "f2-d": "Valores más altos indican mayor superposición, lo que sugiere que las clases están menos separadas y, por lo tanto, es más difícil clasificarlas correctamente.",
    "f3": "Eficiencia Máxima de una Característica Individual: Evalúa la eficiencia de la mejor característica individual para separar las clases.",
    "f3-d": "Valores cercanos a 1 indican que al menos una característica separa muy bien las clases.",
    "f4": "Eficiencia Colectiva de Características: Similar a f3, pero mide la eficiencia combinada de todas las características para separar las clases.",
    "f4-d": "Un valor cercano a 1 indica que el conjunto de características es altamente efectivo para separar las clases.",
    "l1": "Suma de la Distancia de Error mediante Programación Lineal",
    "l1-d": "Mide la dificultad de separar las clases utilizando un clasificador lineal mediante programación lineal. Valores más altos indican que encontrar una separación lineal es más desafiante.",
    "l2": "Tasa de Error del Clasificador Lineal",
    "l2-d": "La tasa de error de un clasificador lineal simple. Valores más altos indican que el problema es más difícil desde la perspectiva de un clasificador lineal.",
    "l3": "No-linealidad del Clasificador Lineal",
    "l3-d": "Mide la no-linealidad del problema con respecto a un clasificador lineal. Valores más altos indican mayor no-linealidad y, por lo tanto, más dificultad para los clasificadores lineales.",
    "n1": "Fracción de Puntos Fronterizos: La proporción de instancias que están cerca de la frontera de decisión.",
    "n1-d": "La proporción de instancias que están cerca de la frontera de decisión. Un valor alto sugiere que muchas instancias están cerca de la frontera entre clases, lo que puede complicar la clasificación.",
    "n2": "Relación de Distancia Más Cercana Intra/Extra Clase: La relación de distancias más cercanas dentro y fuera de la clase.",
    "n2-d": "Un valor alto indica que las instancias dentro de la misma clase están más cerca entre sí que con las de diferentes clases, lo que sugiere una buena separación entre clases.",
    "n3": "Tasa de Error del Clasificador de Vecinos más Cercanos: La tasa de error de un clasificador de k-vecinos más cercanos (k-NN).",
    "n3-d": "Un valor alto indica que un clasificador k-NN tiene dificultad para distinguir entre las clases.",
    "n4": "No-linealidad del Clasificador de Vecinos más Cercanos: Mide la no-linealidad del problema con respecto a un clasificador k-NN.",
    "n4-d": "Valores altos sugieren que el problema no se ajusta bien a una clasificación basada en proximidad.",
    "t1": "Fracción de Esferas Hipersuperficiales que Cubren los Datos: La proporción de los datos cubiertos por las esferas hipersuperficiales mínimas necesarias para cubrir todas las instancias de datos.",
    "t1-d": "Un valor alto puede indicar que los datos están bien concentrados.",
    "lsc": "Cardinalidad del Conjunto Local: Mide el número promedio de vecinos de la misma clase en el entorno local de cada instancia.",
    "lsc-d": "Valores altos indican una alta densidad local de la misma clase, lo que facilita la clasificación.",
    "density": "Densidad de la Clase: Mide la densidad de la clase en el espacio de características.",
    "density-d": "Valores altos sugieren que las instancias dentro de cada clase están empaquetadas de manera densa.",
    "clsCoef": "Coeficiente de Agrupamiento: El coeficiente de agrupamiento mide la probabilidad de que dos vecinos de una instancia también sean vecinos entre sí.",
    "clsCoef-d": "Valores altos indican una estructura de agrupamiento fuerte, lo que puede simplificar la clasificación.",
    "hubs": "Centralidad de Puntos: Mide la prevalencia de los puntos centrales, que son aquellos que frecuentemente aparecen como vecinos de otros puntos.",
    "hubs-d": "Un valor alto puede indicar que algunos puntos son centrales en el espacio de características, lo que puede afectar la dificultad del problema.",
    "avg_samples_per_dimension": "Promedio de muestras por dimensión.",
    "avg_samples_per_dimension-d": "Valores altos son preferibles; pocos datos por dimensión pueden causar sobreajuste.",
    "class_entropy": "Entropía de la distribución de clases.",
    "class_entropy-d": "Valores más cercanos a 1 indican clases equilibradas. Más bajo = más desbalance.",
    "imbalance_ratio": "Relación entre clases mayoritaria y minoritaria.",
    "imbalance_ratio-d": "Valores más cercanos a 1 son mejores. Valores altos indican fuerte desbalance.",
    "Feature-Output-Correlation(Max)": "Máxima correlación entre una característica y la clase.",
    "Feature-Output-Correlation(Max)-d": "Valores altos indican que alguna variable individual es altamente predictiva.",
    "Feature-Output-Correlation(Mean)": "Promedio de correlación entre características y clase.",
    "Feature-Output-Correlation(Mean)-d": "Valores altos implican que muchas características están relacionadas con la clase.",
    "avg_pca_components": "Componentes necesarias para capturar el 95% de varianza.",
    "avg_pca_components-d": "Valores bajos indican que los datos se pueden representar bien con pocas dimensiones.",
    "Metric": "Métrica",
    "Value": "Valor",
    "Measures": "Medidas",
    "Feature-based-measures": "Medidas basadas en características",
    "Class-imbalance-measures": "Medidas de desequilibrio de clases",
    "Dimensionality-measures": "Medidas de dimensionalidad",
    "Network-measures": "Medidas de red",
    "Neighborhood-measures": "Medidas de vecindario",
    "Description": "Descripción",
    "Interpretation": "Interpretación"
}

